app/controllers/todos_controller.rb

  def create
    @todo = Todo.new(todo_params)
    # this is a super long message. why is this message just the longest comment of all time. whoever wrote this really should learn how to use their return key to make a new line. pretty ridiculous.
    'a' + 1
    if @todo.save
---
INSERT INTO "todos" ("title", "notes", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Number 1"], ["notes", "my first note"], ["created_at", "2017-09-28 02:06:14.526122"], ["updated_at", "2017-09-28 02:06:14.526122"]]

  def index
    Rollbar.info('showing the todos index')
    @todos = Todo.all
---
SELECT "todos".* FROM "todos"